In [1]:
import pandas as pd

In [2]:
### Dataset from IMDB with game and genres classified ### 
imdb_df = pd.read_csv('imdb-videogames.csv', index_col=0)
imdb_df.head()

,name,url,year,certificate,rating,votes,plot,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
0,Spider-Man,https://www.imdb.com/title/tt5807780/?ref_=adv...,2018.0,T,9.2,"20,759","When a new villain threatens New York City, Pe...",True,True,False,False,False,True,False,False,False
1,Red Dead Redemption II,https://www.imdb.com/title/tt6161168/?ref_=adv...,2018.0,M,9.7,"35,703",Amidst the decline of the Wild West at the tur...,True,True,False,True,False,False,False,False,False
2,Grand Theft Auto V,https://www.imdb.com/title/tt2103188/?ref_=adv...,2013.0,M,9.5,"59,986",Three very different criminals team up for a s...,True,False,False,True,False,False,False,False,False
3,God of War,https://www.imdb.com/title/tt5838588/?ref_=adv...,2018.0,M,9.6,"26,118","After wiping out the gods of Mount Olympus, Kr...",True,True,False,False,False,False,False,False,False
4,Uncharted 4: A Thief's End,https://www.imdb.com/title/tt3334704/?ref_=adv...,2016.0,T,9.5,"28,722",Thrown back into the dangerous underworld he'd...,True,True,False,False,False,False,False,False,False

In [3]:
imdb_df.drop(axis = 1, labels = ['url', 'plot'], inplace= True)
imdb_df.replace({True: 1, False: 0}, inplace= True)
imdb_df.drop(imdb_df[imdb_df.year < 1996].index, inplace = True)
imdb_df.head()

,name,year,certificate,rating,votes,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
0,Spider-Man,2018.0,T,9.2,"20,759",1,1,0,0,0,1,0,0,0
1,Red Dead Redemption II,2018.0,M,9.7,"35,703",1,1,0,1,0,0,0,0,0
2,Grand Theft Auto V,2013.0,M,9.5,"59,986",1,0,0,1,0,0,0,0,0
3,God of War,2018.0,M,9.6,"26,118",1,1,0,0,0,0,0,0,0
4,Uncharted 4: A Thief's End,2016.0,T,9.5,"28,722",1,1,0,0,0,0,0,0,0

In [4]:
GOTY_df = pd.read_excel('Sample GOTY.xlsx')
GOTY_df.head()

,Year,Game,Genre,Developer(s)
0,1998,GoldenEye 007,First-person shooter,Rare
1,1999,The Legend of Zelda: Ocarina of Time,Action-adventure,Nintendo EAD
2,2000,MediEvil 2,Action-adventure,SCE Cambridge Studio
3,2000,Pokémon Yellow,Role-playing,Game Freak
4,2000,Deus Ex,Action role-playing,Ion Storm

In [5]:
### Is all the games in the dataset? Why not?
len(imdb_df.loc[imdb_df.name.isin(GOTY_df.Game)].name.unique()) == len(GOTY_df.Game.unique())
print('Game Titles not in the dataset: ')
for title in GOTY_df.Game.unique():
    if title not in imdb_df.name.unique():
        print(title)

Game Titles not in the dataset:
MediEvil 2
Pokémon Yellow
Gran Turismo 3: A-Spec
Tony Hawk's Pro Skater 2
Tom Clancy's Ghost Recon Advanced Warfighter

In [6]:
imdb_df.loc[imdb_df.name.str.startswith('Pokémon Y')]

,name,year,certificate,rating,votes,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
2092,Pokémon Yellow Version: Special Pikachu Edition,1998.0,E,8.7,"1,490",1,1,0,0,0,1,0,0,0
3487,Pokémon Y,2013.0,E,8.0,"1,063",1,1,0,0,1,0,0,0,0
10410,Pokémon Yellow Version: Special Pikachu Edition,1998.0,E,8.7,"1,491",1,1,0,0,0,1,0,0,0
10820,Pokémon Y,2013.0,E,7.9,"1,064",1,1,0,0,1,0,0,0,0

In [7]:
print('There are {} duplicates in the dataset.'.format(imdb_df.duplicated().sum()))
imdb_df.drop_duplicates(inplace= True)
imdb_df.info()

There are 5 duplicates in the dataset.
<class 'pandas.core.frame.DataFrame'>
Int64Index: 16170 entries, 0 to 20802
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         16170 non-null  object
 1   year         15903 non-null  float64
 2   certificate  7001 non-null   object
 3   rating       9153 non-null   float64
 4   votes        9153 non-null   object
 5   Action       16170 non-null  int64
 6   Adventure    16170 non-null  int64
 7   Comedy       16170 non-null  int64
 8   Crime        16170 non-null  int64
 9   Family       16170 non-null  int64
 10  Fantasy      16170 non-null  int64
 11  Mystery      16170 non-null  int64
 12  Sci-Fi       16170 non-null  int64
 13  Thriller     16170 non-null  int64
dtypes: float64(2), int64(9), object(3)
memory usage: 1.9+ MB

In [8]:
print('There are duplicate game titles in the dataset {}'. format(imdb_df.duplicated(subset =['name', 'year', 'rating']).sum()))
### Remove the same year, rating and name due to system differences
imdb_df.drop_duplicates(subset = ['name', 'year', 'rating'], inplace= True)

There are duplicate game titles in the dataset 519

In [9]:
imdb_df[imdb_df.name == 'Aladdin']

Empty DataFrame
Columns: [name, year, certificate, rating, votes, Action, Adventure, Comedy, Crime, Family, Fantasy, Mystery, Sci-Fi, Thriller]
Index: []

In [10]:
rating_sums = []
dup_titles = imdb_df.loc[imdb_df.duplicated(['name', 'year'])].name.unique()
for title in dup_titles:
    rating_sums.append(round(imdb_df.loc[imdb_df.name == title]['rating'].mean(), 2))
    
masking = dict(zip(dup_titles,rating_sums))
for dup in masking: 
    imdb_df.rating.mask(imdb_df.name == dup, masking[dup], inplace = True)
    
imdb_df.drop_duplicates(subset = ['name', 'year'], inplace= True)

In [11]:
imdb_df[imdb_df.name == 'Aladdin']

Empty DataFrame
Columns: [name, year, certificate, rating, votes, Action, Adventure, Comedy, Crime, Family, Fantasy, Mystery, Sci-Fi, Thriller]
Index: []

In [26]:
year_dif_dups = imdb_df.loc[imdb_df.duplicated(['name'], False)].sort_values('name').name.unique()
imdb_df.drop(index = imdb_df.loc[imdb_df['name'].isin(year_dif_dups) & imdb_df.rating.isna()].index, inplace= True)

In [31]:
imdb_df.loc[imdb_df.duplicated(['name'], False)].sort_values('name')

,name,year,certificate,rating,votes,Action,Adventure,Comedy,Crime,Family,Fantasy,Mystery,Sci-Fi,Thriller
299,Aliens vs. Predator,2010.0,M,7.1,"1,402",1,0,0,0,0,0,0,1,0
857,Aliens vs. Predator,1999.0,M,8.0,626,1,0,0,0,0,0,0,1,0
3745,Area 51,1996.0,M,6.2,99,1,0,0,0,0,0,0,1,0
990,Area 51,2005.0,M,7.1,519,1,0,0,0,0,0,1,0,0
5171,Army Men,1999.0,T,6.2,49,1,1,0,0,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1986,Xena: Warrior Princess,1999.0,T,6.8,166,1,1,0,0,0,1,0,0,0
3738,Xena: Warrior Princess,2006.0,NaN,7.6,22,1,0,0,0,0,1,0,0,0
6454,Xena: Warrior Princess,2001.0,E,6.4,8,1,1,0,0,0,1,0,0,0
4133,Zoo Tycoon,2001.0,NaN,7.4,266,1,0,0,0,0,0,0,0,0
16400,Zoo Tycoon,2013.0,E,6.1,61,0,0,0,0,1,0,0,0,0

In [55]:
imdb_df.year.fillna(0, inplace= True)
imdb_df.year = imdb_df.year.apply(lambda x: round(x))
imdb_df.year.astype(str,errors= 'ignore',copy = False)

0        2018
1        2018
2        2013
3        2018
4        2016
         ...
20798    2014
20799    2004
20800    2015
20801    2015
20802    2020
Name: year, Length: 15501, dtype: object

In [58]:
imdb_df.rating.isna().sum()

6951